src/Catalogs/InformationLinksForForms.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Catalog>
		<Properties>
			<Name>InformationLinksForForms</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Address</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ConfigurationVersionEarlierThen</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ConfigurationVersionLaterThen</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Weight</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>StartDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UpdateDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EndDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ToolTip</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FullPathToForm</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.FullPathToForms</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/InformationCenterServerCached/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Information center subsystem.
//
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// INTERNAL INTERFACE

// Retrieves a table with information links for forms.
//
// Parameters:
//	PathToForm - String- full path to form.
//
// Returns:
//	ValuesTable - information link table for forms. Contains the following columns:
// 	Description - String - information link description.
// 	URL         - String - information link URL.
// 	Weight      - Number - information link weight.
// 	StartDate   - Date - information link actuality start date.
// 	EndDate     - Date - information link actuality end date.
// 	ToolTip     - String - information link tooltip.
//
Function GetInformationLinkTableForForm(PathToForm) Export
	
	SetPrivilegedMode(True);
	CurrentConfigurationVersion = InformationCenterInternal.GetVersionNumber(Metadata.Version);
	SetPrivilegedMode(False);
	
	Query = New Query;
	Query.SetParameter("FullPathToForm",              PathToForm);
	Query.SetParameter("ZeroVersion",                 0);
	Query.SetParameter("CurrentConfigurationVersion", CurrentConfigurationVersion);
	Query.SetParameter("CurrentDate",                 CurrentDate()); // SL design decision
	Query.SetParameter("BlankDate",                   '00010101');
	Query.Text = 
	"SELECT
	|	FullPathToForms.Reference AS Ref
	|INTO PathsToForms
	|FROM
	|	Catalog.FullPathToForms AS FullPathToForms
	|WHERE
	|	FullPathToForms.FullPathToForm LIKE &FullPathToForm
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	InformationLinksForForms.Description AS Description,
	|	InformationLinksForForms.URL AS URL,
	|	InformationLinksForForms.Weight AS Weight,
	|	InformationLinksForForms.StartDate AS StartDate,
	|	InformationLinksForForms.EndDate AS EndDate,
	|	InformationLinksForForms.ToolTip AS ToolTip
	|FROM
	|	PathsToForms AS PathsToForms
	|		INNER JOIN Catalog.InformationLinksForForms AS InformationLinksForForms
	|			ON PathsToForms.Reference = InformationLinksForForms.FullPathToForm
	|WHERE
	|	(InformationLinksForForms.ConfigurationVersionLaterThen = &ZeroVersion
	|				AND InformationLinksForForms.ConfigurationVersionEarlierThen = &ZeroVersion
	|			OR InformationLinksForForms.ConfigurationVersionLaterThen = &ZeroVersion
	|				AND InformationLinksForForms.ConfigurationVersionEarlierThen >= &CurrentConfigurationVersion
	|			OR InformationLinksForForms.ConfigurationVersionLaterThen <= &CurrentConfigurationVersion
	|				AND InformationLinksForForms.ConfigurationVersionEarlierThen = &ZeroVersion
	|			OR InformationLinksForForms.ConfigurationVersionLaterThen <= &CurrentConfigurationVersion
	|				AND InformationLinksForForms.ConfigurationVersionEarlierThen >= &CurrentConfigurationVersion)
	|	AND (InformationLinksForForms.StartDate = &BlankDate
	|				AND InformationLinksForForms.EndDate = &BlankDate
	|			OR InformationLinksForForms.StartDate = &BlankDate
	|				AND InformationLinksForForms.EndDate >= &CurrentDate
	|			OR InformationLinksForForms.StartDate <= &CurrentDate
	|				AND InformationLinksForForms.EndDate = &BlankDate
	|			OR InformationLinksForForms.StartDate <= &CurrentDate
	|				AND InformationLinksForForms.EndDate >= &CurrentDate)";
	
	Return Query.Execute().Unload();
	
EndFunction
